# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import pandas as pd
import matplotlib as plt
import seaborn as sns
import numpy as np

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
# your code here

#### Print `temp`.

In [3]:
# your code here

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [4]:
# your code here

In [5]:
"""
your comments here
"""

'\nyour comments here\n'

#### Select the rows where state is New York.

In [6]:
# your code here

#### What is the average temperature of cities in New York?

In [7]:
# your code here

#### Which states and cities have a temperature above 15 degrees Celsius?

In [8]:
# your code here

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [9]:
# your code here

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [10]:
# your code here

#### Find the mean and standard deviation of the temperature of each state.

In [11]:
# your code here

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [12]:
# your code here
employees = employee = pd.read_csv(r'C:\Users\joanr\Ironhack\Module 2\Week 4\Labs\lab-subsetting-and-descriptive-stats\your-code\Employee.csv')

#### Explore the data types of the `employees` dataframe. Comment your results.

In [13]:
# your code here
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [14]:
"""
I have 5 categorical and 2 numerical variables.
"""

'\nI have 5 categorical and 2 numerical variables.\n'

#### What's the average salary in this company?

In [15]:
employees.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

In [16]:
# your code here
employees['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [17]:
# your code here
employees['Salary'].max()

70

#### What's the lowest salary?

In [18]:
# your code here
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [19]:
# your code here
condition = employees['Salary'] == 30
employees[condition]

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [20]:
# your code here
condition2 = employees['Name'] == 'David'
employees[condition2]

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [21]:
# your code here
employees[condition2]['Salary']

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [22]:
# your code here
condition3 = employees['Title'] == 'associate'
employees[condition3]

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [23]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [24]:
# Method 2
# your code here
employees.iloc[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [25]:
# your code here
condition4 = (employees['Salary'] > 55) & (employees['Title'] == 'associate')
employees[condition4]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [26]:
# your code here
years_salary_avg = employees.groupby('Years')['Salary'].mean()
years_salary_avg.to_frame()

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [27]:
# your code here
title_salary_avg = employees.groupby('Title')['Salary'].mean()
title_salary_avg.to_frame()

              Salary
Title
VP         70.000000
analyst    32.500000
associate  56.666667

####  Find the salary quartiles.

In [28]:
# your code here
salary_quartiles = employees['Salary'].quantile([0.25,0.5,0.75])
salary_quartiles.to_frame()

      Salary
0.25    35.0
0.50    55.0
0.75    60.0

#### Is the mean salary different per gender?

In [29]:
# your code here
salary_per_gender = employees.groupby('Gender')['Salary'].mean()
salary_per_gender
#A bit unfair for women, but still similar values.

Gender
F    47.5
M    50.0
Name: Salary, dtype: float64

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [30]:
# your code here
stats_departments = employees.groupby('Department')['Years', 'Salary'].mean()
stats_departments

C:\Users\joanr\anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.

               Years  Salary
Department
HR          4.666667   45.00
IT          4.500000   48.75
Sales       2.500000   55.00

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [31]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [50]:
# your code here
orders = pd.read_csv(r'C:\Users\joanr\Ironhack\Module 2\Week 4\Labs\lab-subsetting-and-descriptive-stats\your-code\Orders.csv')

In [57]:
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

In [58]:
orders.shape

(397924, 14)

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [53]:
# your code here
print(orders.dtypes)
print(orders.describe())

Unnamed: 0        int64
InvoiceNo         int64
StockCode        object
year              int64
month             int64
day               int64
hour              int64
Description      object
Quantity          int64
InvoiceDate      object
UnitPrice       float64
CustomerID        int64
Country          object
amount_spent    float64
dtype: object
          Unnamed: 0      InvoiceNo           year          month  \
count  397924.000000  397924.000000  397924.000000  397924.000000
mean   278465.221859  560617.126645    2010.934259       7.612537
std    152771.368303   13106.167695       0.247829       3.416527
min         0.000000  536365.000000    2010.000000       1.000000
25%    148333.750000  549234.000000    2011.000000       5.000000
50%    284907.500000  561893.000000    2011.000000       8.000000
75%    410079.250000  572090.000000    2011.000000      11.000000
max    541908.000000  581587.000000    2011.000000      12.000000

                 day           hour       Quantity      UnitPrice  \
count  397924.000000  397924.000000  397924.000000  397924.000000
mean        3.614555      12.728247      13.021823       3.116174
std         1.928274       2.273535     180.420210      22.096788
min         1.000000       6.000000       1.000000       0.000000
25%         2.000000      11.000000       2.000000       1.250000
50%         3.000000      13.000000       6.000000       1.950000
75%         5.000000      14.000000      12.000000       3.750000
max         7.000000      20.000000   80995.000000    8142.750000

          CustomerID   amount_spent
count  397924.000000  397924.000000
mean    15294.315171      22.394749
std      1713.169877     309.055588
min     12346.000000       0.000000
25%     13969.000000       4.680000
50%     15159.000000      11.800000
75%     16795.000000      19.800000
max     18287.000000  168469.600000

In [34]:
"""
-We only have stats for the numerical values. 
-We have 397924 elements in the dataframe. 
-The Max invoice is 581587 and the min is 536365. We can also observe the mean, and the std, which is good considering the mean value.
-We have data between 2010 and 2011, probably more from 2011 because the mean is almost 2011 (2011 is also the mode).
-Same analysis for the months, we have every month but more data regarding the later ones, because the mean is more than 6; we may have more data
 for the 8th month, which is the mode.
-For the days, the mode is wednesday, we have data for the seven days of the week.
-We only have data between 6h and 20h, and more data at 13h.
-The maximum quantity is 80995 (which is too much, knowing that the mean is 13, it might be an outlier), min is 1, and the majority of people bought a total of 6 units.
-The unit price max is 8142.75 (might be an outlier, the mean is 3.11, it might be a unit that has that price), and most of the units have a price of 1.95.
-The maximum amount spent is too high (may be corrected once we exclude possible outliers), the majority of people spent 11.8, which is far
from the mean (22.39), might be outliers.

Regarding skewness, we may have:

-Negative skewness for month, hour, 
-Positive skewness for day, quantity, UnitPrice and amount spend.

"""

'\nyour comments here\n'

####  What is the average purchase price?

In [60]:
# your code here
orders['UnitPrice'].mean()

3.116174480549152

#### What are the highest and lowest purchase prices?

In [61]:
# your code here
print(orders['UnitPrice'].min(), 'is the minimum')
print(orders['UnitPrice'].max(), 'is the maximum')

0.0 is the minimum
8142.75 is the maximum

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [76]:
# your code here
only_spain = orders['Country'] == 'Spain'
unique_spain = orders[only_spain]['CustomerID'].unique()
unique_spain

array([12557, 17097, 12540, 12551, 12484, 12539, 12510, 12421, 12502,
       12462, 12507, 12541, 12547, 12597, 12545, 12596, 12354, 12417,
       12455, 12450, 12548, 12556, 12550, 12546, 12454, 12448, 12544,
       12538, 12445, 12442], dtype=int64)

#### How many customers do we have in Spain?

In [78]:
# your code here
len(unique_spain)

30

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [79]:
# your code here
fifty_items = orders['Quantity'] > 50
orders[fifty_items]
#Code is missing

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
46,46,536371,22086,2010,12,3,9,paper chain kit 50's christmas,80,2010-12-01 09:00:00,2.55,13748,United Kingdom,204.00
83,83,536376,21733,2010,12,3,9,red hanging heart t-light holder,64,2010-12-01 09:32:00,2.55,15291,United Kingdom,163.20
96,96,536378,21212,2010,12,3,9,pack of 72 retrospot cake cases,120,2010-12-01 09:37:00,0.42,14688,United Kingdom,50.40
102,102,536378,85071B,2010,12,3,9,red charlie+lola personal doorsign,96,2010-12-01 09:37:00,0.38,14688,United Kingdom,36.48
174,176,536386,85099C,2010,12,3,9,jumbo bag baroque black white,100,2010-12-01 09:57:00,1.65,16029,United Kingdom,165.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397720,541702,581566,23404,2011,12,5,11,home sweet home blackboard,144,2011-12-09 11:50:00,3.26,18102,United Kingdom,469.44
397721,541703,581567,21417,2011,12,5,11,cockle shell dish,84,2011-12-09 11:56:00,0.79,16626,United Kingdom,66.36
397729,541711,581567,21326,2011,12,5,11,aged glass silver t-light holder,144,2011-12-09 11:56:00,0.55,16626,United Kingdom,79.20
397761,541746,581571,23167,2011,12,5,12,small ceramic top storage jar,96,2011-12-09 12:00:00,0.69,15311,United Kingdom,66.24
397882,541867,581584,20832,2011,12,5,12,red flock love heart photo frame,72,2011-12-09 12:25:00,0.72,13777,United Kingdom,51.84

#### Select orders from Spain that include more than 50 items.

In [40]:
# your code here

#### Select all free orders.

In [41]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [42]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [43]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [44]:
# your code here

#### Select all orders made in the month of August.

In [45]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [46]:
# your code here

#### What's the  average amount of money spent by country?

In [47]:
# your code here

#### What's the most expensive item?

In [48]:
# your code here

#### What is the average amount spent per year?

In [49]:
# your code here